{
  "Ability Checks" : "Ability checks test a character's or creature's skill or training against a challenge, with the Dungeon Master (DM) setting a Difficulty Class (DC). Success or failure affects the outcome of tasks, from climbing walls to deceiving guards. Specialized skills tied to abilities can add proficiency bonuses to checks, illustrating characters' expertise in areas like Stealth or Persuasion.",
  "Ability Scores and Modifiers" : "Characters and creatures in D&D are defined by six key abilities: Strength, Dexterity, Constitution, Intelligence, Wisdom, and Charisma. These scores range from 1 to 30, affecting various in-game actions like combat, interaction, and skill checks. A score of 10 or 11 is average for humans. Ability modifiers, derived from these scores, influence almost every roll, impacting the success of actions and outcomes in the game.",
  "Advantage and Disadvantage" : "Advantage and disadvantage influence roll outcomes significantly. When you have advantage, you roll two d20s and use the higher number; with disadvantage, you use the lower number. Multiple instances of either don’t stack but cancel each other out. This mechanic introduces an element of strategic luck, affecting ability checks, saving throws, and attack rolls based on characters' conditions and actions.",
  "Combat Essentials" : "Combat is structured into rounds and turns, with initiative determining order. Characters can move and act, with actions ranging from attacks to spellcasting. The combat system emphasizes tactical decision-making, simulating dynamic encounters that test characters' abilities and strategies.",
  "Interacting with Objects" : "Characters can interact with their environment, from drawing a weapon to opening a door. These interactions can occur alongside movement or actions, but some may require using an action depending on their complexity or significance in the scenario.",
  "Movement and Position" : "Movement in combat involves navigating terrain and positioning relative to enemies. Characters can walk, climb, jump, and even fly, with movement speed dictating how far they can move each turn. Difficult terrain, like rubble or thick undergrowth, slows movement, adding a layer of complexity to battle tactics.",
  "Proficiency Bonus" : "Characters gain a proficiency bonus based on their level, enhancing their expertise in certain skills, saving throws, and attacks. This bonus reflects a character's competence and experience, varying from +2 to +6 as they advance. It cannot be added more than once to a single roll. Special rules may apply, like doubling or halving the bonus for specific checks.",
  "Saving Throws" : "Saving throws allow characters to resist or avoid dangers like spells, traps, and poisons. Each class excels in specific saves, reflecting their training and resilience. Success often means reducing or negating damage or effects, pivotal during combat or interaction with the environment."
}