{
  "classes": [
    {
      "name": "Barbarian",
      "description":"A barbarian plays an important role as a protector of their people and a leader in times of war. Life in the wild places of the world is fraught with peril: rival tribes, deadly weather, and terrifying monsters. Barbarians charge headlong into that danger so that their people don’t have to.",
      "hit_die": "1d12",
      "proficiency_choices": "Choose two from: \nAnimal Handling \nAthletics \nIntimidation \nNature \nPerception \nSurvival",
      "proficiencies": "Light Armor \nMedium Armor \nShields \nSimple Weapons \nMartial Weapons",
      "saving_throws": "STR and CON",
      "starting_equipment": "1x Explorer's Pack \n4x Javelin ",
      "starting_equipment_options": "(a) a greataxe or (b) any martial melee weapon \n(a) two handaxes or (b) any simple weapon ",
      "subclasses": "Berserker"
    },
    {
      "name": "Bard",
      "description": "Bards thrive on stories, whether those stories are true or not. Your character’s background and motivations are not as important as the stories that he or she tells about them. Perhaps you had a secure and mundane childhood. There’s no good story to be told about that, so you might paint yourself as an orphan raised by a hag in a dismal swamp. Or your childhood might be worthy of a story. Some bards acquire their magical music through extraordinary means, including the inspiration of fey or other supernatural creatures.",
      "hit_die": "1d8",
      "proficiency_choices": "Choose any three from: \nAcrobatics \nAnimal Handling \nArcana \nAthletics \nDeception \nHistory \nInsight \nIntimidation \nInvestigation \nMedicine \nNature \nPerception \nPerformance \nPersuasion \nReligion \nSleight of Hand \nStealth \nSurvival \nChoose three musical instruments of your choice",
      "proficiencies": "Light Armor \nSimple Weapons \nLongswords \nRapiers \nShortswords \nHand crossbows",
      "saving_throws": "DEX and CHA",
      "starting_equipment": "1x Leather Armor \n1x Dagger",
      "starting_equipment_options": "(a) a rapier, (b) a longsword, or (c) any simple weapon \n(a) a diplomat’s pack or (b) an entertainer’s pack \n(a) a lute or (b) any other musical instrument",
      "subclasses": "Lore",
      "Spellcasting Ability": "CHA",
      "Cantrips": "You know two cantrips of your choice from the bard spell list. You learn additional bard cantrips of your choice at higher levels.",
      "Spell Slots": "The Bard table shows how many spell slots you have. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
      "Spells Known of 1st Level and Higher": "You know four 1st-level spells of your choice from the bard spell list. You learn more bard spells of your choice at higher levels. Each of these spells must be of a level for which you have spell slots. Additionally, when you gain a level in this class, you can choose one of the bard spells you know and replace it with another spell from the bard spell list, which also must be of a level for which you have spell slots.",
      "Ritual Casting": "You can cast any bard spell you know as a ritual if that spell has the ritual tag.",
      "Spellcasting Focus": "You can use a musical instrument as a spellcasting focus for your bard spells."
    },
    {
      "name": "Cleric",
      "description": "Not every acolyte or officiant at a temple or shrine is a cleric. Some priests are called to a simple life of temple service, carrying out their gods’ will through prayer and sacrifice, not by magic and strength of arms. In some cities, priesthood amounts to a political office, viewed as a stepping stone to higher positions of authority and involving no communion with a god at all. True clerics are rare in most hierarchies.",
      "hit_die": "1d8",
      "proficiency_choices": "Choose two from: \nHistory \nInsight \nMedicine \nPersuasion \nReligion",
      "proficiencies": "Light Armor \nMedium Armor \nShields \nSimple Weapons",
      "saving_throws": "WIS and CHA",
      "starting_equipment": "1x Shield",
      "starting_equipment_options": "(a) a mace or (b) a warhammer (if proficient) \n(a) scale mail, (b) leather armor, or (c) chain mail (if proficient) \n(a) a light crossbow and 20 bolts or (b) any simple weapon \n(a) a priest’s pack or (b) an explorer’s pack \nholy symbol",
      "subclasses": "Life",
      "Spellcasting Ability": "WIS",
      "Cantrips": "At 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels.",
      "Spell Slots": "The Cleric table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. You prepare the list of cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots.",
      "Spells Known of 1st Level and Higher": "You prepare the list of cleric spells that are available for you to cast, choosing from the cleric spell list. You can change your list of prepared spells when you finish a long rest. Preparing a new list of cleric spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.",
      "Ritual Casting": "You can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared.",
      "Spellcasting Focus": "You can use a holy symbol as a spellcasting focus for your cleric spells."
    },
    {
      "name": "Druid",
      "description": "For druids, nature exists in a precarious balance. The four elements that make up a world—air, earth, fire, and water—must remain in equilibrium. If one element were to gain power over the others, the world could be destroyed, drawn into one of the elemental planes and broken apart into its component elements. Thus, druids oppose cults of Elemental Evil and others who promote one element to the exclusion of others.",
      "hit_die": "1d8",
      "proficiency_choices": "Choose two from: Arcana \nAnimal Handling \nInsight \nMedicine \nNature \nPerception \nReligion \nand Survival",
      "proficiencies": "Light Armor \nMedium Armor \nShields \nClubs \nDaggers \nJavelins \nMaces \nQuarterstaffs \nSickles \nSpears \nDarts \nSlings \nScimitars \nHerbalism Kit \nSaving Throw: INT \nSaving Throw: WIS",
      "saving_throws": "INT and WIS",
      "starting_equipment": "1x Leather Armor \n1x Explorer's Pack",
      "starting_equipment_options": "(a) a wooden shield or (b) any simple weapon \n(a) a scimitar or (b) any simple melee weapon \ndruidic focus",
      "subclasses": "Land",
      "Spellcasting Ability": "WIS",
      "Cantrips": "At 1st level, you know two cantrips of your choice from the druid spell list. You learn additional druid cantrips of your choice at higher levels.",
      "Spell Slots": "The Druid table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these druid spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. You prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. When you do so, choose a number of druid spells equal to your Wisdom modifier + your druid level (minimum of one spell). The spells must be of a level for which you have spell slots.",
      "Spells Known of 1st Level and Higher": "You prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. You can change your list of prepared spells when you finish a long rest. Preparing a new list of druid spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.",
      "Ritual Casting": "You can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared.",
      "Spellcasting Focus": "You can use a druidic focus as a spellcasting focus for your druid spells."
    },
    {
      "name": "Fighter",
      "description": "Fighters learn the basics of all combat styles. Every fighter can swing an axe, fence with a rapier, wield a longsword or a greatsword, use a bow, and even trap foes in a net with some degree of skill. Likewise, a fighter is adept with shields and every form of armor. Beyond that basic degree of familiarity, each fighter specializes in a certain style of combat. Some concentrate on archery, some on fighting with two weapons at once, and some on augmenting their martial skills with magic. This combination of broad general ability and extensive specialization makes fighters superior combatants on battlefields and in dungeons alike.",
      "hit_die": "1d10",
      "proficiency_choices": "Choose two skills from: \nAcrobatics \nAnimal Handling \nAthletics \nHistory \nInsight \nIntimidation \nPerception \nSurvival",
      "proficiencies": "All armor \nShields \nSimple Weapons \nMartial Weapons \nSaving Throw: STR \nSaving Throw: CON",
      "saving_throws": "STR and CON",
      "starting_equipment_options": "(a) chain mail or (b) leather armor, longbow, and 20 arrows \n(a) a martial weapon and a shield or (b) two martial weapons \n(a) a light crossbow and 20 bolts or (b) two handaxes \n(a) a dungeoneer’s pack or (b) an explorer’s pack",
      "subclasses": "Champion"
    },
    {
      "name": "Monk",
      "description": "Monks make careful study of a magical energy that most monastic traditions call ki. This energy is an element of the magic that suffuses the multiverse—specifically, the element that flows through living bodies. Monks harness this power within themselves to create magical effects and exceed their bodies’ physical capabilities, and some of their special attacks can hinder the flow of ki in their opponents. Using this energy, monks channel uncanny speed and strength into their unarmed strikes. As they gain experience, their martial training and their mastery of ki gives them more power over their bodies and the bodies of their foes.",
      "hit_die": "1d8",
      "proficiency_choices": "Choose two from: \nAcrobatics \nAthletics \nHistory \nInsight \nReligion \nStealth \nChoose one type of artisan’s tools or one musical instrument",
      "proficiencies": "Simple Weapons \nShortswords",
      "saving_throws": "STR and DEX",
      "starting_equipment": "10x Dart",
      "starting_equipment_options": "(a) a shortsword or (b) any simple weapon \n(a) a dungeoneer’s pack or (b) an explorer’s pack",
      "subclasses": "Open Hand"
    },
    {
      "name": "Paladin",
      "description": "A paladin swears to uphold justice and righteousness, to stand with the good things of the world against the encroaching darkness, and to hunt the forces of evil wherever they lurk. Different paladins focus on various aspects of the cause of righteousness, but all are bound by the oaths that grant them power to do their sacred work. Although many paladins are devoted to gods of good, a paladin’s power comes as much from a commitment to justice itself as it does from a god.",
      "hit_die": "1d10",
      "proficiency_choices": "Choose two from: \nAthletics \nInsight \nIntimidation \nMedicine \nPersuasion \nReligion",
      "proficiencies": "All armor \nShields \nSimple Weapons \nMartial Weapons",
      "saving_throws": "WIS and CHA",
      "starting_equipment": "1x Chain Mail",
      "starting_equipment_options": "(a) a martial weapon and a shield or (b) two martial weapons \n(a) five javelins or (b) any simple melee weapon \n(a) a priest’s pack or (b) an explorer’s pack \nholy symbol",
      "Spellcasting Ability": "CHA",
      "subclasses": "Devotion",
      "Spell Slots": "The Paladin table shows how many spell slots you have to cast your spells. To cast one of your paladin spells of 1st level or higher, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. You prepare the list of paladin spells that are available for you to cast, choosing from the paladin spell list.",
      "Ritual Casting": "N/A",
      "Spellcasting Focus": "You can use a holy symbol as a spellcasting focus for your paladin spells."
    },
    {
      "name": "Ranger",
      "description": "Warriors of the wilderness, rangers specialize in hunting the monsters that threaten the edges of civilization.",
      "hit_die": "1d10",
      "proficiency_choices": "Choose three from: \nAnimal Handling \nAthletics \nInsight \nInvestigation \nNature \nPerception \nStealth \nSurvival",
      "proficiencies": "Light Armor \nMedium Armor \nShields \nSimple Weapons \nMartial Weapons",
      "starting_equipment": "1x Longbow \n20x Arrow",
      "starting_equipment_options": "(a) scale mail or (b) leather armor \n(a) two shortswords or (b) two simple melee weapons \n(a) a dungeoneer’s pack or (b) an explorer’s pack",
      "subclasses": "Hunter",
      "Spellcasting Ability": "WIS",
      "Spell Slots": "The Ranger table shows how many spell slots you have. You regain all expended spell slots when you finish a long rest.",
      "Spells Known of 1st Level and Higher": "You know two 1st-level spells of your choice from the ranger spell list.",
      "Spellcasting Focus": "N/A"
    },
    {
      "name": "Rogue",
      "description": "Rogues devote as much effort to mastering the use of a variety of skills as they do to perfecting their combat abilities.",
      "hit_die": "1d8",
      "proficiency_choices": "Choose four from: \nAcrobatics \nAthletics \nDeception \nInsight \nIntimidation \nInvestigation \nPerception \nPerformance \nPersuasion \nSleight of Hand \nStealth",
      "proficiencies": "Light Armor \nSimple Weapons \nLongswords \nRapiers \nShortswords \nHand crossbows \nThieves' Tools",
      "starting_equipment": "1x Leather Armor \n2x Dagger \n1x Thieves' Tools",
      "starting_equipment_options": "(a) a rapier or (b) a shortsword \n(a) a shortbow and quiver of 20 arrows or (b) a shortsword \n(a) a burglar’s pack, (b) a dungeoneer’s pack or (c) an explorer’s pack",
      "subclasses": "Thief"
    },        
    {
      "name": "Sorcerer",
      "description": "Magic is a part of every sorcerer, suffusing body, mind, and spirit with a latent power that waits to be tapped.",
      "hit_die": "1d6",
      "proficiency_choices": "Choose two from: \nArcana \nDeception \nInsight \nIntimidation \nPersuasion \nReligion",
      "proficiencies": "Daggers \nDarts \nSlings \nQuarterstaffs \nLight Crossbows",
      "starting_equipment": "2x Dagger",
      "starting_equipment_options": "(a) a light crossbow and 20 bolts or (b) any simple weapon \n(a) a component pouch or (b) an arcane focus \n(a) a dungeoneer’s pack or (b) an explorer’s pack",
      "subclasses": "Draconic",
      "Spellcasting Ability": "CHA",
      "Cantrips": "At 1st level, you know four cantrips of your choice from the sorcerer spell list.",
      "Spell Slots": "The Sorcerer table shows how many spell slots you have to cast your spells of 1st level and higher.",
      "Spells Known of 1st Level and Higher": "You know two 1st-level spells of your choice from the sorcerer spell list.",
      "Spellcasting Focus": "You can use an arcane focus as a spellcasting focus for your sorcerer spells."
    },
    {
      "name": "Warlock",
      "description": "A warlock is defined by a pact with an otherworldly being, gaining power in exchange for servitude.",
      "hit_die": "1d8",
      "proficiency_choices": "Choose two skills from:\nArcana\nDeception\nHistory\nIntimidation\nInvestigation\nNature\nReligion",
      "proficiencies": "Light Armor\nSimple Weapons",
      "saving_throws": "WIS and CHA",
      "starting_equipment": "2x Dagger\n1x Leather Armor",
      "starting_equipment_options": "(a) a light crossbow and 20 bolts or (b) any simple weapon\n(a) a component pouch or (b) an arcane focus\n(a) a scholar’s pack or (b) a dungeoneer’s pack\nany simple weapon",
      "subclasses": "Fiend",
      "Spellcasting Ability": "CHA",
      "Cantrips": "You know two cantrips of your choice from the warlock spell list.",
      "Spell Slots": "You have spell slots that are restored on a short or long rest, all of the same level.",
      "Spells Known of 1st Level and Higher": "You know two 1st-level spells of your choice from the warlock spell list.",
      "Spellcasting Focus": "You can use an arcane focus for your warlock spells."
    },
    {
      "name": "Wizard",
      "description": "Wizards seek to master the arcane arts, with spells that can achieve almost anything from summoning fire to bending the fabric of reality.",
      "hit_die": "1d6",
      "proficiency_choices": "Choose two from:\nArcana\nHistory\nInsight\nInvestigation\nMedicine\nReligion",
      "proficiencies": "Daggers\nDarts\nSlings\nQuarterstaffs\nLight Crossbows",
      "saving_throws": "INT and WIS",
      "starting_equipment": "1x Spellbook",
      "starting_equipment_options": "(a) a quarterstaff or (b) a dagger\n(a) a component pouch or (b) an arcane focus\n(a) a scholar’s pack or (b) an explorer’s pack",
      "subclasses": "Evocation",
      "Spellcasting Ability": "INT",
      "Cantrips": "At 1st level, you know three cantrips of your choice from the wizard spell list.",
      "Spell Slots": "The Wizard table shows how many spell slots you have to cast your spells.",
      "Spells Known of 1st Level and Higher": "At 1st level, you have a spellbook containing six 1st-level wizard spells of your choice.",
      "Spellcasting Focus": "You can use an arcane focus for your wizard spells."
    }
  ]
}